;; -*- no-byte-compile: t; -*-
;;; completion/packages.el

(package! embark)
(package! consult)
(package! consult-flycheck)
(package! embark-consult)
(package! marginalia)
(package! selectrum)
(package! selectrum-prescient)
(package! wgrep)
